#pragma once

// Name: Squad, Version: 13-01-2021


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass AnimBP_UH60.AnimBP_UH60_C
// 0x20C0 (FullSize[0x2A50] - InheritedSize[0x0990])
class UAnimBP_UH60_C : public USQVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0990(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0B89C3ED478CE36725111AA1826D4D75; // 0x0998(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6B62015349F6958948D1B6853DB4CBBD; // 0x0AA0(0x0108)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8C83D21E4801BB879CEB7FAC8BDD2952; // 0x0BA8(0x0078)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_411BBAB44C629E644D6B5088C4DC273E; // 0x0C20(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C4853A8B45CEAF11CAE721A2B818C18E; // 0x0C40(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AF9F74D24FCE040203E100ACB6E967AA; // 0x0C60(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_26FB62FF48438A6572303AA099A93BC3; // 0x0D68(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CA316C2D446D983BEBCCAC9807264875; // 0x0E70(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C208F1954495AE6E5D156DAB24111EE2; // 0x0F78(0x0108)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F9A7931147F03E6D4EE0C489606FDCF0; // 0x1080(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F476E50746C0AB8399714B981BE1F801; // 0x1138(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_075C6181422C4A5DB2627383B7BFA479; // 0x1160(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_B66DEA9544A7AB4ABE633A8B37C34596; // 0x1188(0x00C0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_E80906434577F718C95F928AC8E6FEAC;       // 0x1248(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F42C14254B14CECE923A3C8F0BD0D252; // 0x1290(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EE21BCD240DE47825C75BD8A691404DD; // 0x1398(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DD93570A4DC10831EB13319EA8257DD7; // 0x14A0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_416489DE42AA6D0829ACCF82385AC89C; // 0x15A8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_12852A914585580C92E96CB848601B77; // 0x16B0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CE0A81EC4F204BC108FEA8BDF681D760; // 0x17B8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6BF6ACC24AF69C756FE4A39A78FEF585; // 0x18C0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_73FD18FB4417455F9C4818973FF258D4; // 0x19C8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BA077BD04C12C00CE77DA589DE9DA6EF; // 0x1AD0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A26C47974074EF085E7A2EA60437DAA1; // 0x1BD8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_58F5837146760DFFC158C19DA37A689D; // 0x1CE0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EDDA9D5346A4EAB7C626A2AF8A1EC002; // 0x1DE8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_231A4A6B4EAA4F52AC1C2FBAAC4BA432; // 0x1EF0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2AD1D9FF40642996A55FEF93F7CCA902; // 0x1FF8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4163F5E24E1008689341AF839811A813; // 0x2100(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_08DDA7B84FD340AA3E019F9642054F49; // 0x2208(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4E3761AB4ECEBAD4838D2BB477E1DE27; // 0x2310(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D60E29434A9FDE79337393B3C68BFC60; // 0x2418(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DE09DE5A477382860148B49C28B761D4; // 0x2520(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_663988174A77B57BF1293BBEA5EBE3A0; // 0x2628(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AAA2B2E646C3B174E6655C9FF365EB4B; // 0x2730(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D1AFB7D84DB8F845E04F8CB98D34CEA7; // 0x2838(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_Root_CB3C3A0940969B2768382C8126AB83D7;       // 0x2940(0x0030)
	struct FRotator                                    MainRotorRotation;                                         // 0x2970(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    TailRotorRotation;                                         // 0x297C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    MainIncidence0;                                            // 0x2988(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    MainIncidence1;                                            // 0x2994(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              BladesLiftAlpha;                                           // 0x29A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                                    MainIncidence2;                                            // 0x29A4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    MainIncidence3;                                            // 0x29B0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                              MaxLiftDegrees;                                            // 0x29BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                                    TailIncidence0;                                            // 0x29C0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    TailIncidence1;                                            // 0x29CC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    TailIncidence2;                                            // 0x29D8(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    TailIncidence3;                                            // 0x29E4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    RearTailRot;                                               // 0x29F0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    ControlStickRot;                                           // 0x29FC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                     MainBladesBlurScale;                                       // 0x2A08(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     MainBladesScale;                                           // 0x2A14(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     TailBladesBlurScale;                                       // 0x2A20(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     TailBladesScale;                                           // 0x2A2C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     MainRotorScale;                                            // 0x2A38(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     TailRotorScale;                                            // 0x2A44(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass AnimBP_UH60.AnimBP_UH60_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void GetBladesScale(class ABP_Generic_Helicopter_C* Helicopter, bool Main, struct FVector* Blades, struct FVector* BlurBlades);
	void RPMtoDegPerSec(float RPM, bool MainRotor, class ABP_UH60_C* Helicopter, float* DegPerSec);
	void GetCurrentRotorRPM(class ABP_Generic_Helicopter_C* Helicopter, bool Main, float* RPM);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_AnimBP_UH60(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
