#pragma once

// Name: Squad, Version: 13-01-2021


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass AnimBP_MI8.AnimBP_MI8_C
// 0x2158 (FullSize[0x2AE8] - InheritedSize[0x0990])
class UAnimBP_MI8_C : public USQVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0990(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5F6990D1489D5698F0E2ACBB2A689079; // 0x0998(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6718801F4E38CCC5A051899C4B87CCBA; // 0x0AA0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A57D0B7E4344F33DD71076BE29B6BAF6; // 0x0BA8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7B13B16645CD3003ABF39DAC6DD08A06; // 0x0CB0(0x0108)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F402CB67419F179568B73C8D096467F2; // 0x0DB8(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1163B9C345626945B7ADF6920D34177F; // 0x0E70(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E9F9BA78464DE0BE17B5618878739B0E; // 0x0F78(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_093010D5419F98542929E2B89CDCC1B2; // 0x1080(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A308D371462DD90B046DCA83CBA449DB; // 0x1188(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_48AAE64E453BAA6DDB9EE38033A305A9; // 0x1290(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_FFBA8FE14CF60FEA343031A25986D5E6; // 0x1398(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5A6A47C64ED57D512119539D3B7947AE; // 0x14A0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BB06841D49B44F25ED2637A3FDABFF10; // 0x15A8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_795565434566C44419FCF29533E342D5; // 0x16B0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_668FB14B4648F63BED35B9B3C064B3F7; // 0x17B8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E319FFB64E4E670D7789179B503A4643; // 0x18C0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B995719F40479B1B98A09EB781FC7D92; // 0x19C8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C6922A83438D360CD848DDBF9CFFAE28; // 0x1AD0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_030C82564F02FCC5BF9EEB9EF9322180; // 0x1BD8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E3AB2DB84D69E10B0E50FEB1B78D36BF; // 0x1CE0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_60ACDD494313CB2A4B5B15886D8101EB; // 0x1DE8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_47F2D2A44119A05BEED04C86FDAFEEE0; // 0x1EF0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AB11AD604AA69879D3A4AF80C7868153; // 0x1FF8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DACD801F4AC4F8413E1437962A91315C; // 0x2100(0x0108)
	struct FAnimNode_MeshSpaceRefPose                  AnimGraphNode_MeshRefPose_64D8F4A7468A746E5D03C09814DA01B3; // 0x2208(0x0010)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_06F02ACE4162D7832551FDBA8D0CA31C; // 0x2218(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2477716645ADA651A469719A6C3FDAC0; // 0x2240(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3FD918ED4325B41F0ADA58BC9F2471C1; // 0x2268(0x00C0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F10E202C4236CAC275B9A5AAE570C1F9;       // 0x2328(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_102FC5DC4C4F8FA445D342A03D2B897E; // 0x2370(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_277003854D82EF65373F6FADA0DA7980; // 0x2478(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_777AE61040BC13C0C8FA74BC24EDDF55; // 0x2580(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B8BB555041B505D71944BEAD4172334F; // 0x2688(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_9421E3E948F666ADB4FF4DAE6C9BDACE; // 0x2790(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_240FEFDA42FE0CBCE3261BAAC26726DF; // 0x27B0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0F8D63394556175603DD9B9C35E2BA91; // 0x28B8(0x0108)
	struct FAnimNode_Root                              AnimGraphNode_Root_B8EA444E4B7F1DFBDB9BD49E7B41167A;       // 0x29C0(0x0030)
	struct FVector                                     Wheel_Front_Scale;                                         // 0x29F0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Wheel_Rear_L_Scale;                                        // 0x29FC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Wheel_Rear_R_Scale;                                        // 0x2A08(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                                    MainIncidence0;                                            // 0x2A14(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    MainIncidence3;                                            // 0x2A20(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    MainIncidence1;                                            // 0x2A2C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    MainIncidence2;                                            // 0x2A38(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    TailIncidence0;                                            // 0x2A44(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    TailIncidence1;                                            // 0x2A50(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    TailIncidence2;                                            // 0x2A5C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    MainIncidence4;                                            // 0x2A68(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    TailIncidence3;                                            // 0x2A74(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    TailRotorRotation;                                         // 0x2A80(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    MainRotorRotation;                                         // 0x2A8C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                     MainBladesScale;                                           // 0x2A98(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     MainBladesBlurScale;                                       // 0x2AA4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     TailBladesScale;                                           // 0x2AB0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     TailBladesBlurScale;                                       // 0x2ABC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              BladesLiftAlpha;                                           // 0x2AC8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                              MaxLiftDegrees;                                            // 0x2ACC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                                    RearTailRot;                                               // 0x2AD0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                                    ControlStickRot;                                           // 0x2ADC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass AnimBP_MI8.AnimBP_MI8_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void RPMtoDegPerSec(float RPM, class ABP_MI8_C* Helicopter, bool Main, float* DegPerSec);
	void GerCurrentRotorRPM(class ABP_MI8_C* Helicopter, bool Main, float* RPM);
	void GetBladesScale(class ABP_MI8_C* Helicopter, bool Main, struct FVector* Blades, struct FVector* BlurBlades);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_AnimBP_MI8(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
