#pragma once

// Name: Squad, Version: 13-01-2021


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_1P_Upper.BP_1P_Upper_C
// 0xD208 (FullSize[0xDDE8] - InheritedSize[0x0BE0])
class UBP_1P_Upper_C : public USQAnimInstanceSoldier1P
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0BE0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_2D2E48394D92F3F0D1830D8BA2ED337D;       // 0x0BE8(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CD4A5DA1409ABDCA6FC3C1871464BE3E; // 0x0C18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6D3371A34337CEDCA1103AB62B4C1855; // 0x0C40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_739F4D0F4C28919E5C0C499B031AE584; // 0x0C68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9AEB132643CDFA9CE27D23B07172DF59; // 0x0C90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A3DAD6E444D9D5D931669299876798A2; // 0x0CB8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA71E7714F027B794BCF9FBDA8ED4D6E; // 0x0CE0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CFD66A6347C7D426DA5D378547A1FD4A; // 0x0D08(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_75334EBF43E180C12F034380DF63B04D; // 0x0D30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A177B5FA495A24F1C5E925A362232EF6; // 0x0D58(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8012826D43042B410AA53784C77264F9; // 0x0D80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C9FEEFC488E75519E4007B307F1AB6E; // 0x0DA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6005A205463EA546DD6EC9A55E5D0DA5; // 0x0DD0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A665968B49EDAFE8561271B1862BAEB9; // 0x0DF8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C59CCF974B64B9E799C5D6959FC68C2C; // 0x0E20(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CF18629B41754A851DD60090267A89C8; // 0x0E48(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A58F1C1C48D35CE6F267F8ADD40C610C; // 0x0E70(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D4312C89403A06D10AFEAFB50BBA6FA7; // 0x0E98(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A22FC84D4C1602B7D50D0CA45DCA4060; // 0x0EC0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B5576EDA4AC4F67E506518916B5B090D; // 0x0EE8(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_45ADCBCE4E18BA2D8808A29954FA6AC8; // 0x0F10(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_567A15E54D169A74622EA3A10B9E6B8A; // 0x0F40(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_CF38F0AD4DD4B88E303B76BC282854F4; // 0x0FB8(0x00C0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_98C713AA40668EB84A037AA47FA42BDA; // 0x1078(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_41DCDA37428D75B1EDA5B6AE04EEAB15; // 0x1140(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_FBC88E064ACF340834B8F0AE21A74A31; // 0x1168(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_42FAEF5D40B7DBEEF71279973C639F0B; // 0x1228(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_150321DF4DE19E5B5B1846B26F55A9F9; // 0x12A0(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5B1F253A404ABB37DD0C9598EEFBADDA; // 0x1368(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0A2663164C49A5BDB0C23E855234CB8B; // 0x13E0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D658CF8D4425EC07F632A486E8175574; // 0x14C0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7264EC544CB38F537C6E3DB1C0348928; // 0x1538(0x00C0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3E11EEBE4B1885FFB53B03BBB32D54B5; // 0x15F8(0x0030)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_638E4F4A4DAE82D45D703AB73EE3F1CD; // 0x1628(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_602560D2474375BBE27B3AA363AE41E7; // 0x16E8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0A95334446C258CAA451269ECF858590; // 0x17A8(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7E48419942F2914C696F389BB97BF6F5; // 0x1820(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D6BD5F2F43F147F3B8E0959AE29F9056; // 0x18E8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_CF58163F4927ACB7DB9E5C9EB0B5E953; // 0x1910(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_56F5CFD34FB63DCB3CA96FA055C72623; // 0x19D0(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7535B0D482A92023538B29D69AE815F; // 0x1A48(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_B02FBB7C4073910742F587A4C69E5068; // 0x1AC0(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7B0796BC4B53FC83EA32B1B62A020314; // 0x1B88(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73686929452D28EDDB4CE3BD68A912B5; // 0x1C68(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4910266448D3FB62C3D90E8DBB336EA1; // 0x1CE0(0x0030)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2E4452EA4717F24300F9F790CA5AE670; // 0x1D10(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41E1D2E24B01CBEDB4BF27928BED216E; // 0x1DD0(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_FD928CB341AFD9E0511721AF12E7E783; // 0x1E48(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_567786B84F0BF6583D0E649F2E881231; // 0x1F10(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_12D712EA49BA91E60FD750B448D8A84D; // 0x1FF0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_47E73D454F5B752831AB0B8F0711F673; // 0x2068(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_947A0B4C4C96C3EF7C869BA411EB7649; // 0x2128(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_147954A546E18935150DBEA503E97C65; // 0x21A0(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_674BE10143711B8DD57C78A83B859347; // 0x2268(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D2E458D443681CF913B0E386DE91A458; // 0x2290(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7A465DE347835D517D9D3B849F2C1E87; // 0x2350(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_67B8049A45477B3E89A782A9336CD45F; // 0x23C8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DBD67FE44971B07B0CB6158A2A071783; // 0x23F8(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D8B05A6E4A3F4EBEDE729F96D8121FDB; // 0x2470(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D873E9DA46450E0EEE0B4CBAD8A4B0D0; // 0x2510(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7DCEDD9440830343C4D75E9010EF7252; // 0x25D8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D40B52E94A978733DF8D24B678B9B9A3; // 0x2600(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_95644E26499A51D4422AE4B009C4B8F8; // 0x2628(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_FFE4EB45450E05EBBC07DF800CD70945; // 0x2650(0x00C0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_CE5964C04F7653BFD8900D8E7014C48D;       // 0x2710(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AAA5EB9941AEEF93E5DEEFA78E60F6D6; // 0x2758(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5A64AC0549A33344082F98A0B006D064; // 0x2788(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6A4686F6402409691DB333B19EC3BEDB; // 0x27B0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1DC392B142C525E51AF3C7A2C2699C72; // 0x2850(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_3EDCFB1B46D70B0634762E945055414D;       // 0x2878(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_C9901A584CBEE1F7247330A6D90DAB8F;       // 0x28C0(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_308F1C4F4EE80986FDDA348C38199F6F; // 0x2908(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02A564804C979C7600D2B483590E657C; // 0x2938(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E19DE7F64E14526BEEF533BFA22DB94F; // 0x2960(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FDF6191444F76FEC8CA5AB825D012B01; // 0x2988(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F9139F8E4F713EF3EC7BFC838B947AE3; // 0x29B0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9FF720EE4584500123E20A8633B08E53; // 0x29D8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_31C24E3D46E5245F9FA08EA6C50EA527; // 0x2A50(0x00C0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_542D5E2248C13672E369BA9E3CB17AEE; // 0x2B10(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DE60C2C14885C484C32DF1AA7246E26C; // 0x2BD8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3DDB4E90418D3C482CF4F6BFCAE3C2CE; // 0x2C00(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2EC6CB364BF80161529E828ED86C2D53; // 0x2C78(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BAD7AD4349CAEBF0C853C9A875C93777; // 0x2CA8(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3F3355554FF8DFC82939D18BD7BB75B7; // 0x2D70(0x0078)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E21FE2B84F011F5E18D53E8528E0B817; // 0x2DE8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C9C47F0244F6CE31D920768CE716E6AC; // 0x2E10(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6A5C6A2347DB633CD5BD398DE612E93C; // 0x2E38(0x00C0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_FE9BC64B49E52B4A7E7768B4F0A3009A; // 0x2EF8(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FA16E7E94869AE8B4B2C68A6E8A4599D; // 0x2FC0(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_09EF63B4444A4FDB9EED53A2D72C0DCD; // 0x2FE8(0x0030)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_EC6B23D34A62F203EF17C59B097494ED;       // 0x3018(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_987682AA49CA0BD885A18992CA958E77; // 0x3060(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7949A83544BAE21329C28CA0CEBEA60B; // 0x3088(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B9B131294C097728455DD099C634CCD1; // 0x30B8(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CD47DA1B4EA75E6B58C053921980B5FD; // 0x3168(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_CA3B23B54A4FC593136E759A45AD0909; // 0x3198(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_82B230924C4142EF79E90398DF69399F; // 0x3248(0x0020)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_6ACFA8214341C46EA29B14A3EA233386;   // 0x3268(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_186F13F440CE3EF36A9EAEBD33C97A1F;   // 0x3358(0x00F0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B978FB6E4DEBE9D8CE8E808AEB4216EB; // 0x3448(0x0108)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3622E3C148CD8CEDAB3A0DB8C3698DFE; // 0x3550(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AEBA00C441CE72E324AA9E89AB575484; // 0x3608(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_85B900FB40E7732117CDC8A05A8272C6; // 0x3630(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8966536E4C0FEB8A78F496BB4F0DC908; // 0x3650(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A86DCFAB47A2EF1A7EC70899A6433D3D; // 0x3678(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4A8484F34CE7B71EAF1C08B4173D1B16; // 0x3718(0x0108)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_7FB7CDF94A10B1A8974273AED132F9B1;   // 0x3820(0x00F0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E62C314B4852A8349FD994A24FAF4B4E; // 0x3910(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_6723620E406FF9310E2E45B72F126ECA; // 0x3A18(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F43A73F4428DF4F7DCA5DDA6D7E8F605; // 0x3A38(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C4449691402E21763C2C2E9CBD688AE3; // 0x3AD8(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E94C33EF41FEA4A6BD0E3B8FE5DC3C39; // 0x3B00(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_8F30082146666D7FB9F06C89F5A13BE7; // 0x3C08(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0CED29834CE0CEA96007EC828CE8F962; // 0x3C28(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_56FC118444FBD9C6B8709EB95614CBD0; // 0x3C48(0x0108)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_1F83B5C34EB1290D662DC48306B3130A; // 0x3D50(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9CEE3C2C44E3406B4912C4AA8DA8E07C; // 0x3E08(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A43A90834E7A79DDFBA8D094493B86DA; // 0x3F10(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A7E8423549BE0E5D9062E59AC63533F8; // 0x3FB0(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_62F44CCD43A9AE2BD48DA182371C6502; // 0x3FD0(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_75CAA3FF44577176F771A2BED897F411; // 0x4088(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EF7BE3364F0E002F529915BAF7AB199F; // 0x40A8(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D63244A541BEC5D3379CFE81D2C783DC; // 0x40D0(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9213903B48BE3D42B9B9A596CA95EF71; // 0x40F0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E307694A49CA81B00303199C1097379E; // 0x4118(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_017A9462496A37F9103D2C923C0BF17E; // 0x41B8(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_DEA67BC24385592FF3C9DFB76ADBDA93; // 0x41E0(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_F05DA7DC4329F269BF3764B438BB3052; // 0x4200(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DCE418EC4180DD6DADCD399123F5C5F9; // 0x42B8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_97C06A894631E85E4364F09A22926A70; // 0x4358(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_1C59676542A7A1EE115B738C1F6C4011; // 0x4380(0x00B8)
	unsigned char                                      UnknownData_EJDC[0x8];                                     // 0x4438(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_047DA51B4C33577783615A96D9A93927;  // 0x4440(0x01E0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_5908D61445DAF3263D5FF19C94095E0B;  // 0x4620(0x01E0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_6B7610BB443C52DFDA99AD903440836C;  // 0x4800(0x01E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5F6AB4784460053C100BF38BA3E5B91B; // 0x49E0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_796D896E4CA6EBCB662F5CB4D9644733; // 0x4A80(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C12269834E2FDB5B932D7A8FC72D9552; // 0x4AA8(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2731B9F64216DDBA79CA3F96DF95E1B1; // 0x4AC8(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_6027501A4069321E2655D39EB549893D; // 0x4AF0(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_181C22814B273BAC2CB184A9C0BC4956; // 0x4B10(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_8BA113B34712358923B265BF997CCB1B; // 0x4B30(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0F381A1148F161523ADE59B5668244E7; // 0x4B50(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_BA32DB7C42B8EEBC722A24A1D6119ACF; // 0x4B70(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E923741648F7ACBBC3207C8DF8C93927; // 0x4B90(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6B5CCA13470F4173A6142CA9D20C8A17; // 0x4BB0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_43CC20324BD10F760C55AA8377304508; // 0x4C50(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_40AD26F547514EC4A57181ADE1D78F10; // 0x4C78(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_99D7725347DADDC4DDE362AD0B37C5CD; // 0x4C98(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_205662554C79015D92B88A8EB90A760D; // 0x4D38(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_29CA58334CB2B3E686E4E4BDD6B11FD9; // 0x4D60(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_47DDF8FC47F64A45FD03508570364209; // 0x4E68(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_08CF10DA449CF783ABC269B895DE6B46; // 0x4E88(0x0020)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8FA8AD1D489E2A7DC3B805B9897FBECC; // 0x4EA8(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_243FDF6D4FB8AB8E305E28BC1D922D00; // 0x4F48(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_B398C8AA4534194D143FD08B134E4BEF; // 0x5050(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A45F3CA147EF72478583F4AFBA9E108B; // 0x5070(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A8F140BD432987B5A047F182FBA4842B; // 0x5128(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_46B52F8342559234A61EC4A3CB334616; // 0x51C8(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_82ADF0504AB3AE715610D1AD35C4E17F; // 0x51F0(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_35C71E614EB39D94A7059C949B02B75E; // 0x5210(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_026F69BE4D1777FA876565B2345C41A3; // 0x5238(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_109A8CC5481D4660D31EDC8344DC53C8; // 0x5258(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_48073ABC4A6603D6A9A34F8C6B2326B6; // 0x5360(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9901B049419D57BBA97B57A91902683F; // 0x5468(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9D1CCD1D40767C6BC8AB5F8F167A3EAA; // 0x5570(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D90146C24B543E0558C41F9E1701761C; // 0x5678(0x0108)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D308F1D445AEFF09E0D85EB205915E4B; // 0x5780(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0379B1704714D6E8539F54A0ECB9EFCD; // 0x57A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF25B269451CC5A50E2EDC8D3716DD7D; // 0x57D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C70BD947495A8484B9AED7AD3BFBD98A; // 0x57F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BBFCCE8742DB0D2ADDA02B8EC2F3219F; // 0x5820(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_190E5095414F5B800CAE1B9D261494E2; // 0x5848(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3F5F6FCD4286C90ADA0F99AC7EC71E17; // 0x5870(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3064021C48A12E1F22C9FFAD438FC3D8; // 0x5898(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_FCA3F8384DEC9A1F54A77C8167F99901; // 0x58C0(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CFE708D94AC7E8EF6CFEDB8EE94E2E8F; // 0x5988(0x0028)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_6F513DC54545001D0DB455AE1B767FE8; // 0x59B0(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9193127F4469CDB892CB77AFC58729C4; // 0x5A78(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_01E3085E4998F9DACB8ACC8B847951DD; // 0x5AF0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3230E91F46D768B77D80AAB96A2B1EE7; // 0x5B68(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FDCFE4704F8DABF87BF850A76A5BC30F; // 0x5B98(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DD9A56C74096F5DD108FB88DCAF83884; // 0x5C10(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F9E60BF6455310B9D846A8AA20AB738F; // 0x5CB0(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_80D10CFB407DBC87D3D9AAAC0A97FC77; // 0x5D78(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_96D1598C4F57CE1453B702ADCE24426A; // 0x5DA0(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9A4071E4400D8B36F8F1718341FEEACB; // 0x5E18(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CF35DDAC484153139E6A3A9EB4E19AE4; // 0x5EE0(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_EB6AFF2C4688BDF734DBFDB865659DFD; // 0x5F58(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_51F10E754DA8EFAB9BF76D9C99B98113; // 0x6020(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4EE716984C53613C874FC3896562B44B; // 0x6098(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_C1BC2B754BFA7E14398F6AAA18B9E0D3; // 0x6110(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_144EDF534B7A1E0975F4D6BF12A0B3F1; // 0x61D8(0x00E0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_D79C77F34FD64830604CB0A415B29B7C; // 0x62B8(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_24C5E6084718033AE4DD46BC399F2DB3; // 0x6380(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_65E9E5CD4E17B7F2AABF53BA33E10EF5; // 0x63F8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A856D7DA44B6599CF5EE279EB1F28F09; // 0x64B8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A5FC64B741BE7CD90FA623B4709A9369; // 0x6530(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_FFA733A7496BEF506B8594BD5A19FB29; // 0x6560(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4134EA894D65DC860B75BA904845156D; // 0x6628(0x0028)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_AFEC5BD94EDCA990927295833D500074; // 0x6650(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C0D2ED284431292F41C232A8567853D6; // 0x6718(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_07F9A113476710ABA34E028EEFC34D2A; // 0x6790(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A64A4DF24263320BD2421D99BC68CB85; // 0x6808(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B5B1C5D34D96A7A9266D71B0D8BC27A0; // 0x6838(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_752F897D4CDE92369A84CCACB11ED4DD; // 0x6860(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_55A2CEFF41080766A1818CAF34367488; // 0x6890(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_30C83F1043D270A4082358BBE3DA7F04; // 0x6940(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A2B4A7FF46428CFA6102AB9CA32C0937; // 0x69F8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_47AB2B8E4B744B46195EB5B759F72ACA; // 0x6A20(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_162C42E1449F21DCE2CECF8DAFBDD513; // 0x6AC0(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CCCC4B49419B259B349579AECFA4B195; // 0x6B78(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A01B1F743CD44B2910E439961E7837D; // 0x6C18(0x0078)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64C6875C400CC9F528AA8FA8BA25FAE3; // 0x6C90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E4BF4FA6416DE01E36885A8DE7D3F451; // 0x6CB8(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0487D9A24E15445B9C6AE799C4DF787F; // 0x6CE0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8F6C9A1043BBF710C55F4591C8D519CF; // 0x6DE8(0x0108)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_028DCF3A47E561DBF89760A4D9B961EE;       // 0x6EF0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_D7A27AA048585F7B8DA0F093C6C15832; // 0x6F38(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E61C01F044AC77E30ACB8C979A223112; // 0x6F58(0x0020)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_B8070BD74DA16DA2B111B58CC7455D5F; // 0x6F78(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_CEB57A274D6E9CA28BDB04BCC660EC81; // 0x6FC0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A067AEAE445AA4368FAD0AA3F4B73C12; // 0x7008(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_339A020646945F951D7D62AFF03E9BB8; // 0x7050(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_DD1364454DA20CF54FB548A6CBA3F51E; // 0x7110(0x00C0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_E0395CC94D461F6102DDFD8856A0F470;  // 0x71D0(0x01E0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_B1B734E84818806A42413AA102DF030A;  // 0x73B0(0x01E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F0D8C1EA441CBC67239181B6600F0945; // 0x7590(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_12CC7E76450D774179A1619C4CFC877F; // 0x75B8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_52D24B6646B37CC98E0EF6AE7847B4F8; // 0x7658(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D33E277947A6BC8075BEC3B2DD03E6A0; // 0x7680(0x00A0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_6EFC1ECC47290FD44E0237A6DEA5FF1C;  // 0x7720(0x01E0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_798D70DB4AD70047E6D1268CBB93AC2A;  // 0x7900(0x01E0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A53AC34B4851103F229398AE90FA06D3; // 0x7AE0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8D84C2F34B2BFE3260B9DA94EC7CB562; // 0x7B00(0x0020)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_838D3D0B4E42AD43426097B266911D6E; // 0x7B20(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_29B006214E004B512CE08DAE84550DE1; // 0x7B50(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FA032B5B469CCD5FF0C54E85E6252EFD; // 0x7B78(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3FA610CC487DE835007B7A91C006EB7D; // 0x7BA8(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E2699FCE49B33D78676FB587B3EFD287; // 0x7C58(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0DF6420247D96BC7D8B164B581650818; // 0x7C80(0x00B8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6CDFDB7B4D5A4076872EC59EA5E9A55C;       // 0x7D38(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_FFAD05614660CD9AE1184C8342AB02A6; // 0x7D80(0x00C0)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_6D14B1074E7CB98C4210D49A8881835E; // 0x7E40(0x0118)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4CDAF7914AF627CEF13462B3569A9715; // 0x7F58(0x0020)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_3F2B6E484ACE043DA7965CA43259947F; // 0x7F78(0x0118)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_0FF913054BBDFE113D436FB21A44F1DE; // 0x8090(0x0018)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_D52841174B546291BB32509BAF274450; // 0x80A8(0x0020)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_26227D7947F3EF0D646C4A8B09C49CB2;       // 0x80C8(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_709EEA024DFDA1F7A7D5D191FF391311;       // 0x8110(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_01F0E6B849F7ACA0D50BC0AD801C43CB;       // 0x8158(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_3E0A15834FFDFBE5A993DF9F210D8C2B;       // 0x81A0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E2509BAB47D7224455BFD68D8C1D7DE9; // 0x81E8(0x0020)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_DF1BE9DE430E3304BBF93C9527DD2825;       // 0x8208(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_DFE69011477CC2844B6653B89EAE672D;       // 0x8250(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0A6C156F47E33532400D17A0F5FAAEAF; // 0x8298(0x00B8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2CBF496F4A0B1B2547E286A07E9AF044; // 0x8350(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_16BA44364250B656C57203B358C6FFEF; // 0x8430(0x00B8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_DC22419C485176C5DEBE418218400242;       // 0x84E8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D3E47CEB4E6A2AC48651209E7F7228A4; // 0x8530(0x00C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_30D15C2040161478F9894FB3338E3F2F; // 0x85F0(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5AAC99414409D64FA5A7688F61348C0D; // 0x86A8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_24C18589437A36EFE4F8DFAAB3F100A7; // 0x86D0(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9F9A10314F250B9134FE169B09BB501F; // 0x86F8(0x0108)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_D82FA0B54333BF4340A0E593117F0369;       // 0x8800(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BBC7E63E45B1378E1817C9AEBC2558FD; // 0x8848(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2FCE885648618ED473E333A88A3FBB09; // 0x88E8(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_7CD8A97F42AECDDE41533A9632AA1EA1; // 0x8910(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_75847EEF4403CDFDD6AE3DB42058CD6D; // 0x8930(0x0020)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_605B60A1460708DE9C12ABA0E985C878; // 0x8950(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_24BDB6F742D1EA26D5F318AF4A9CDA85; // 0x8A10(0x0078)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7F6C7EAF41D402229B3A46A10A383B03; // 0x8A88(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0FB6F386485BEB0484E2D997BFD29BD3; // 0x8B90(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7F1518BB42E522273255A38EE9199B4C; // 0x8BB0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8C8507304AE0F51088FC7B9CBFD28CD9; // 0x8BD0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3FA176B4433201AAB3A4589A14AFCD69; // 0x8CD8(0x0108)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2D88A75C4A9B8465670F0695F5B3094C; // 0x8DE0(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_A2D832BE4F05A8F4CF29BCAC1C73C3C4; // 0x8E08(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_601D93F6492A740F6130C0BD8EFAD020; // 0x8E28(0x00B8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_499FD82140DD7D12E511528B5DE59B87; // 0x8EE0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_790E34004C7C5AE431660EA4211F8015; // 0x8F08(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_434CBB054A47CDDB6B4865A9270823AC; // 0x8F30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F3DF74D84AD4F464EC822093A412E7D5; // 0x8F58(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_868303F7401A98113A8DEC87FC5D0A7E; // 0x8F80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1236A6741EED08067E4E083C2B656E9; // 0x8FA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_596E5B6043AFE864B9B57BBBDFF11C87; // 0x8FD0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71D46BC4450BF5086CB75CB0339132F9; // 0x8FF8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8BB0523446F499BCEF009A96A30ABB9A; // 0x9020(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15FD4FF547287B6544364D9B566CF79A; // 0x9048(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_25D9173A4480107E4E2C3B9A2605D459; // 0x9070(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E0645AF4A8906E27FC846BF58E3D71B; // 0x9098(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B8AD850146D34D5003F27AA59D622602; // 0x90C0(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2A3CA7A348611DD272C43FA4472D4B4E; // 0x90E8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_A1EAE06A4C41D013B77AD0A60A0662CC; // 0x9108(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B2CB8D314E4216B30B1E00988FDF1AED; // 0x9128(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EF66A4614E967A5F6DA1C7947D9FEB68; // 0x9230(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_646EB38345E500C1A3BF16802FF78068; // 0x9338(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5A8E0E0645246161BB14CBA42E19C1F7; // 0x9440(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4519176040AF9D2FD2AE409143FF55D7; // 0x9470(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_53D01A234E66874353764BB90AEDAF8E; // 0x9498(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_30D9247E42DE937E31494B90949FDE11; // 0x94B8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9CD22D8147D190EFB3E77DA20C3547D4; // 0x94D8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_34322B5F48CB7D94FB3854BDB634F66C; // 0x95E0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2AC1D66E4F0E3FEA8FA93ABC2228E816; // 0x96E8(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E2C3F5774BE28279F7AEE2BF4060CF61; // 0x97F0(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_82BC0B3E4A40937BE45A62A129614F12; // 0x9820(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7AC57CB04C30A0B8F623358E4CDBB890; // 0x9848(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_CAFD6C1443E637E73F75AAADE787F1C8; // 0x9878(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AFE8DB9D493B9F9138AF7CA930F10418; // 0x9928(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1F545F78479B89D2B8B2E6973395EA28; // 0x9958(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2ADEEE9A4EC1F1F72A0447804A22307E; // 0x9980(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8D0BD43A401607ACA0978EAD7F98E498; // 0x99A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_78364DD3471B4DA133536DBD6F854DA0; // 0x99D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B2E19C54795F3C22E97BB978BC7586E; // 0x99F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE6C1A4E43CA7D2B828DE582FDE6D388; // 0x9A20(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F7B738FC4CE80AFD25C000B1B3BEDC64; // 0x9A48(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2F5BDD764C363EDFD2BB768E7F805B84; // 0x9A70(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_94DF38DE420F26D55617CC825E5A2453; // 0x9A90(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_646FDA5149030811B8939190938AF681; // 0x9AB0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4A3B6531412AB4D9CEDEE78AA88C74B8; // 0x9BB8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5BC6488F47834F3FCD27A7A7DCE3C240; // 0x9CC0(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A0AE60024084BF1F65F1AEA5C222C248; // 0x9DC8(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_19665F424DB7526536E3728DB7853965; // 0x9DF8(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_17D5828245C5C16705064A9548F474C8; // 0x9E20(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_54FDD37644399390C6B74CA44C92FBAD; // 0x9E40(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_683264D3453AA5C512D6E1829C409C1E; // 0x9E60(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_217DC04B4EA83D8E1C8F12B9345EB483; // 0x9F68(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_95879C7447725B5FDEF896A995A3ADFD; // 0xA070(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2A1A8F324BA6DEEE243C4BA9CEC5900A; // 0xA178(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_71999FD344F4B1D0F8605C882723F7A6; // 0xA1A8(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D957BC2D42DA2375CE32ECAAFCC5A065; // 0xA1D0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D8558F2C4EB5AC30FF757F9FAF328EC4; // 0xA200(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AEF272B44F988AC36FE3C692B469EFD4; // 0xA2B0(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8BBD0594F71CC1CE4D2E3919D7CA21F; // 0xA2E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3BC508824E89324F3B2D50845F6FAAEE; // 0xA308(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_832CB6E244B13DF9D1C908BDBB61B2F3; // 0xA330(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60B2A06848983C3B32C13AA37B036B49; // 0xA358(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C55927A41FD62EB8345FCA81F41364B; // 0xA380(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F08FAB44F693E97B7BE38AA57B17F2B; // 0xA3A8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5259187440C555639B6C35B85BB03DAD; // 0xA3D0(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_ED7080AC4C444475A689CBAA58C3715D; // 0xA3F8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_70A7DF3A42F57D1DED9BB3B1754DB4D6; // 0xA418(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C0C32BE74DB8E828533932BC11DBB3DD; // 0xA438(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BFAD5D1E47C0F16A53D9E99212F85779; // 0xA540(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5834961A4EC6939FEF2E8294911C9DD7; // 0xA648(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_69BFD379449F56F0656F539983AAEA82; // 0xA750(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_56A242994DA8C9C2231307BA4EEBD262; // 0xA780(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E6DB81F844EE79ADA87098888F851A51; // 0xA7A8(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_96759E3F418917F784091390E35403BB; // 0xA7C8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1B884B96432020F9038BA186AF3F77B4; // 0xA7E8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9DA828D547CA69CDA43E10B21D1E2DF8; // 0xA8F0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_769D2A3B48AB0F3DCDC84A9B82C592F2; // 0xA9F8(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D75007974E7DBD0952465596AF19590C; // 0xAB00(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6D3B441445804609B575F680C6C1D3B2; // 0xAB30(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8739AD4A4F5BF6B16F426383082B185B; // 0xAB58(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_CC4180D746A6ED188A1CEA8AD41666C9; // 0xAB88(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B1E26A02425FCCB6BFEE0C9045B6743C; // 0xAC38(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1FF6EE6640E03F674C1D1080C0E3EC6A; // 0xAC68(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4ED4368245638C5266BC3285B79D35E5; // 0xAD18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F360F2E49F4C22C5A477D8FFD53BFE8; // 0xAD40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E02669234942EB4D1F2E49B7AE0D4083; // 0xAD68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BF71BD964AC220DC6B988CAC7D0FDC4B; // 0xAD90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_80B7ED7A4E0D9C4FA7EF77B5C94B59BD; // 0xADB8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EA8FB29241B38580E775B0B96E37686D; // 0xADE0(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_6B966CE74D905DF54C9DDD96CED4BBFB; // 0xAE08(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7C2ECBAC449A2D2013DD8F9CB22F5B69; // 0xAE28(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E81BDD5D40ACBD8A6944C4A67D2D465C; // 0xAE50(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_63E7BA4F47AF7DCF11DFAAA502885F81; // 0xAE70(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E161578B4B2AA70CAB80C08B60F22E0B; // 0xAF78(0x0030)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_EE7E23C14778CB0317A877963D9F935D; // 0xAFA8(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_05C85AAF423703B398730E92DB7FB540; // 0xAFC8(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_3A5BEE304B93504BB7346FBF1E14C34F; // 0xAFF0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_675948D24BC2F2C68176BCBB4A9EB923; // 0xB010(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4A585E654761EBC95005B8BE7D0A25E8; // 0xB118(0x0030)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D4706A5643AC53B21700E8B125BEAACA; // 0xB148(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2607504A4B94986CC1057DBEAB42506B; // 0xB168(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_435B73F24FF351D96C44BB96168DD255; // 0xB190(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_34526AAC40ADA8D83574AC9490B28F61; // 0xB1B0(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_58647DFA4BAF36446858D7BFDEE5721F; // 0xB2B8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C49597544D6A3B13DE33B49DE7AC5CFC; // 0xB2E8(0x00B0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F51DE6BF4AE3E099514BD99FD363A4F7; // 0xB398(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_94251DD04B71D4947474A0B69F1086FC; // 0xB438(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7F223FA149492F4DEE830A9C02163651; // 0xB540(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3F5E1437446D67C71BE0B4A125464723; // 0xB560(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_AA33439E4BB4A967533FBFB53E7D5823; // 0xB588(0x0020)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_710772EB4C43BE508351048DAE6D4D59; // 0xB5A8(0x00C0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_708F37DD4E5B423E0D5A65BA88B75C77;       // 0xB668(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_81E6816C48459DDBB773FDB86B6BAB24;       // 0xB6B0(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_92CB13DE4E690963770279A2AC33D57B;       // 0xB6F8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DDCE8ADD45D879F0379440B0BCA36785; // 0xB740(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_FE651736468020D810CDE39FBA6FA443;       // 0xB768(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0C84EC58443B27AE60A58A9479AA1069; // 0xB7B0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A2AB3E2C4ADACE3602EF72A10D3849C4; // 0xB7D8(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6D2F74C04AC017A214C42B8FA5FBD830;       // 0xB800(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_82BA4AAB4335DB65E9381786A3B82EC1;       // 0xB848(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0624AD4B4E6147F5D5D4CD98BB881DB0; // 0xB890(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6D33ED32426259DD698B39B7508EB8B6; // 0xB948(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5FD9C44F48A84C29C05C1D99FED59C95; // 0xBA50(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E1DC59134D880258BB80649AEDD274B8; // 0xBA70(0x0020)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_2D68C7854A7DBF5CF34EE28A15BB8EC9; // 0xBA90(0x00C8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AD0A8BB04D40A099DCABF0B373F90C0F; // 0xBB58(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D4CBC414425A519F42F1F1943B094618; // 0xBC10(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2D518E8D43511C33C60BB097990326C0;       // 0xBC38(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F23E169445427E118663B68E4DB715ED; // 0xBC80(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5955CBA04AEBBAC2E9D104962D08ACDD; // 0xBCA8(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7B21E6ED49AE3A0F3ABADB8176CDFAB0; // 0xBD60(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_68D19C374ACAFCA4C3E72E925AFBA539; // 0xBD88(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E8DD795F4D52924CC3564DB333FB0E8B; // 0xBE28(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A0A3480148AC9877E039C880AFC6224B; // 0xBE50(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7099B4584447D4B2705D769E66129CEA; // 0xBF18(0x0078)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BD08019B4BC54303154AB08148258CB4; // 0xBF90(0x0028)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_5AA9DFE348C1F62D6ED5A8914D674D71; // 0xBFB8(0x00C8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E6E3FDA9450D8FA0B7473F8AAF177A01; // 0xC080(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_91C8348D41611CFD9C513C96AF4E1F80; // 0xC120(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DF3D487E426BFD94AC1ACE8EBB84D470; // 0xC148(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_BD72AE784FADE412DFC2F5B07E762485;       // 0xC170(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_7EDEB53B4FB2144CD9599F9FC195A968; // 0xC1B8(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0E6B5A4642877D1A5D35748E81351A87; // 0xC280(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9176102143D57507299D738365D9C097; // 0xC2A8(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3AF1F12B4EC42E03A1463DA0F4C76E8E; // 0xC360(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4F6FA3484E2D726C2F2237811D662206; // 0xC388(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_FB93E78741A362F8A58984916F3AD937;       // 0xC3B0(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_8958CB9B40FC1DF8397B19B0F2EE880F;       // 0xC3F8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2F2D44224E06EA0F028F5EB2E926C747; // 0xC440(0x00B8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_05085E7845C4051E2D401A9E9BBF59D6; // 0xC4F8(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_52D0D3174EB2E7BFAA0AE38A69D434E3; // 0xC5C0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0248CD5E431C34B22833658AFA607994; // 0xC5E8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9D7FB0BB4D784BC58FEA98855108727C; // 0xC610(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_22FA5E304FF21DF778DE5CA102F4894F; // 0xC638(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E225C4A44F370CB0117401A2B65104E6; // 0xC740(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0D9C35F242281CB8F247228EA2CFD7B6; // 0xC848(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_75ED6E514A9F6583B6258AAEAEBA4553; // 0xC950(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_DDEF2BBE4050EB586D374F940F0006C6; // 0xC970(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2B5022194DAC14406A1FC1A819A26B93; // 0xC990(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_33B0D6B74B94CE91916723971F5FB6B3; // 0xCA98(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_775D80644A3A89A42B8949BA167C015B; // 0xCBA0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_931A16344DB1E48B37AEE2BEB8BB67A8; // 0xCCA8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_481811B449449A9924CB46B9927A76AC; // 0xCDB0(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C40B66744B562188A4FFFFA6A09B5A6E; // 0xCEB8(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C9C4E598437C12657EB259A915BECF6C; // 0xCED8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DFA304F449E11C3B512034884C1D0966; // 0xCEF8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_31BCFA8C4020EC5B6DD4E4934E9EE093; // 0xD000(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_044B2D7440B5C8B83483EAB1DCA77911; // 0xD108(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C2DC9B4E426B71E6B6CE5AB5A0CCE2C5; // 0xD210(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_CEF907864BCF9E69A762F7A43A688BDC; // 0xD230(0x0020)
