#pragma once

// Name: Squad, Version: 13-01-2021


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_3P_4.BP_3P_3_C
// 0xFED8 (FullSize[0x10BB8] - InheritedSize[0x0CE0])
class UBP_3P_3_C : public USQAnimInstanceSoldier3P
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0CE0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C065CD694D27F38CEF3F2AB0CAD4EE9F; // 0x0CE8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1D963E1F48C51D4900775EBA8C342424; // 0x0D08(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0079899A4AE4D58A1471ACAAD929F592; // 0x0E10(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0995E8754D6CD8D9FA2FAD863C6DFC8D; // 0x0E30(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C646C6364B392581A79DB38CE26F4CB7; // 0x0F38(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E8EC71AB4E495597B8D4BC829D8D9069; // 0x0F58(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D2899CCA43456563159FAB98EAD79F4B; // 0x1060(0x00A0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_5B9A1E294EB4EE21D31CD1AF0EAAC260;  // 0x1100(0x01E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4DD4606F482C90E304B82F95A2394E35; // 0x12E0(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_89DA005244B283115A3B7C9B98D122F8; // 0x1380(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7CB8A3ED45D171556F92468A4AF69284; // 0x13A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_59965DB0493A0B0C7FA96AA2DE84F4CB; // 0x13C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_136E14E243440CC8ADB69D9935717914; // 0x13F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_462C765F4EAD1021C60AD296499F8AA8; // 0x1418(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7DF4813641D35A4B71D8C0B3D9F90FEC; // 0x1440(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_57EA681747B4489CE9561197564B27EC; // 0x1468(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17C33B5645070F2127A2B497A6387E20; // 0x1490(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A0ADB8FF41CF4361C38580937B42F7AF; // 0x14B8(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A618DE18464482D06FC35AA80AAAA969; // 0x14E0(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F0A5CD264BC615B66B25568A62E0EAEB; // 0x15A8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_854560624BD461DE30BC7B9ABF5E1607; // 0x15D0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2C22740E4986E4CDA902DAAAC883024F; // 0x1648(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_148271584B2153C5586073859D84341D; // 0x1678(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2DB679BC491C23C7B0CD449E47C53308; // 0x1740(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1C9C979D4095E71CDA56C487C7F37F06; // 0x1768(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1820911F46CA104A1A652280F0B71DE4; // 0x17E0(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9D13455547E9334B7A90FFAF28860C87; // 0x1810(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_30A7A207462BFFA036AFBAB2B3082189; // 0x1838(0x0030)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F8319BCE4EB2A7F688A258BC83E59E4D; // 0x1868(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7A33127441FFF004E5517B87128A9685; // 0x1930(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A338CBE84A9CC1FD3D46E29F0229517B; // 0x1958(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_64FF259A4C108CAC95B2BEB33120CCB5; // 0x19D0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C223AAA540053D69CD1FA7957123A396; // 0x1A00(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE8D1CE74FC925BED90C37BB667685CA; // 0x1AB0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B774F93432AFF51DAB107919574D298; // 0x1AD8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_94316B8543F2183363E5DD823F6A8641; // 0x1B00(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71CB1C00407ACEC29F9C22874B9595A6; // 0x1B28(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A818A1A046B638B461E637A983923A71; // 0x1B50(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F113D7454FD2A826160689996A8D840B; // 0x1B78(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02DBF49646D65505CD83748E38B4C6AE; // 0x1BA0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_49D228F04E40F55C622302B4DF79A431; // 0x1BC8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0149BB8B47394B1A740C42828495B4D4; // 0x1BF0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A65F2E384D287264FC51F8B41E3C9C2E; // 0x1C18(0x0028)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_68A2BD984F28A85216ED4995E8DBF66E; // 0x1C40(0x00C8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F060F21D41990FFE8B6C56BB1217BCC4; // 0x1D08(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_24A54AF4400D7713EA5FD8AB916914BD; // 0x1DD0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_19B7552943874101023204986A8BBCEB; // 0x1DF8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7DD56D84012BE5796AC3A820FBF0610; // 0x1EB8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8632118B4EAEF721637EBEACA8B29383; // 0x1F30(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CD541FE04B3AC9538DCCA68C3F2C60A0; // 0x1F60(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F33976F241C3F98E98C187ABFC02C91B; // 0x1F88(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_5C922557442517FA1E6EDF872079CCDC; // 0x2090(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_877E912F437FB284C5B7569B708FF986; // 0x20B0(0x0020)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_9ACE6DF941BDD5B874400FB2C9164D47; // 0x20D0(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E96AC68F496B6175C94A3A9EE142B3EE; // 0x2170(0x0108)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_23D2D7704445BE2B239C04B1C809FF31; // 0x2278(0x00E0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_5D4A85E84F3A4BF68CD2F7A648E7AA7A; // 0x2358(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8D4A46CC418D20E6147C95950E6AD3C8; // 0x2420(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2D3404EA4A8B6DA9BB83D89EFCED07CC; // 0x2450(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_49FDD53E4F37AD06B02627A42C69B66D; // 0x2478(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9B99123842A998163F43948865F4E5F6; // 0x2540(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_ABA01A034F57919ED3DC25B72D402E82; // 0x2568(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E944DDC84590AA1DBED883AC7C23D77F; // 0x2598(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F0FC76384FAA2E93C303448D1841565B; // 0x25C0(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_6CAF59CA48AF0CAAA63C029DED3845AF; // 0x2638(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7E2D3E7F4609BE282321D88AA1F8C6BA; // 0x2700(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_26845D0D471E2145C5F468886CC0A49F; // 0x2730(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_70BF4F86453620588C7FE7B979A5736C; // 0x27E0(0x00B8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3732C2314E5B2F1F1327D9A194650671; // 0x2898(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C6948F7C480EA3F2CE4FE6BEFCD46D49; // 0x28C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14DC7692400F4D7959A4EA9B0D83F51D; // 0x28E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48DCA31C49D0833A83E6758E3D59BB7D; // 0x2910(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FE0B4744487F379BE86A558C2B5EA5FC; // 0x2938(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DDC7E42149BFC856429707B82BDDCD63; // 0x2960(0x00E0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_832BD4C043F38173AF78F0861131F282; // 0x2A40(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B298C2DB43D408CACCCBA6B499D855BB; // 0x2A60(0x0020)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_1F3D4E45454AA6AC0B4696A31AEBE2AA; // 0x2A80(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2A17F1EF4A0E0C34EBCA4896FBD5C8A7; // 0x2B20(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C60898434CBC04BF8C130A9A92370071; // 0x2C28(0x0108)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_77B69E7D4ED9918AF101208FF909C88E; // 0x2D30(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E8F7DC5946E5E0C5F653F881BB6687FD; // 0x2DF8(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E0F9627C4515D5A5832791BCEC43B9BC; // 0x2E28(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_12C93D9D497F4F5CC0EBDAAF04C73388; // 0x2E50(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1C36E01B481D7F328C14E3A3FC6C2981; // 0x2F18(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AA99DB99431EBE25D02087A130172208; // 0x2FF8(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B38D5CFD48DEF697E5F1F98E3A2691CF; // 0x3028(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8EDFC7AE4D1CB926E31DEB9DBD815051; // 0x3050(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A3BD81B845EC80CE494A5F8FCEE63A48; // 0x3118(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1C84B4934C3207A4F10EC8A2F767A19D; // 0x3190(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_286AD092435E3EE5EBA13ABCA92BA94C; // 0x31C0(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_19DC649044CB3E69E32536A4CC045636; // 0x3270(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_B97B10BD4BCF43FC098B8683A4F049A2; // 0x3328(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7378775A41A3C089B70C4E91540CCF7E; // 0x3348(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_FC95F14D427B20DC0B14B4A78C2C5477; // 0x3368(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7E42B21E48728902326AB9B1EB4209AD; // 0x3470(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2C4073BB4046F409A4E3F389509A045C; // 0x3578(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_17A1B05949D1813F262FDDBD585C3538; // 0x3618(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AE0DDAA7411FCF98A2F603954F4A0373; // 0x3638(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F3D0A62E49352C6B9B7E3D8A993ADC64; // 0x3740(0x0108)
	unsigned char                                      UnknownData_6O29[0x8];                                     // 0x3848(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_608AB475470CD77F5895E8A1AB82DBF4;  // 0x3850(0x01E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_918E75AB4E56F0DF19EC20B8111F2598; // 0x3A30(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_CC5AED1E4E755FA65AFAF58B1329B932; // 0x3AD0(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2A1002A4447AD309867F3AB27383E5FA; // 0x3AF0(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_851417D04B1D092224E9B58110744EC6; // 0x3B18(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_09D69EE7492330662588469A5FE03C83; // 0x3B38(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_EB6343B2443A65D827FBA6BFB235D6C1; // 0x3B60(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_0E4C52BC4201A3C6F8BCAFAD20811E5F; // 0x3B80(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_B16136224861B7BE14B1BB9168A7B811; // 0x3BA0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3AE8434C4371F2DE11649FB768BACBA6; // 0x3BC0(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DCAEDBDF42CE60B1E3EFDF8633230C56; // 0x3CC8(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_617C0B324B58E5CA81BB82A7BECEE89E; // 0x3D68(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_36FB27E548CDAA3A543C229DC4F00D1E; // 0x3D88(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F3BC58F54BADAA5D7CD3D59B16DB1367; // 0x3DA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8E725DC14435AEA19C45F59E2BB6B98A; // 0x3DD0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_58248FCD4C5BE4FD0743DFA156987657; // 0x3DF8(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7B59AD0D4981E6B8F20347B9DF7FCDF8; // 0x3E20(0x00E0)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_AB3D0E124016415FC05AE281A71992BB; // 0x3F00(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_253593354775DE94382F55B92DDA1B32; // 0x3F48(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3A4867434364958AF771C1A5409FECA3; // 0x3F70(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_52F7C58F426B273184A00FB30556687B; // 0x3F98(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_85CF8D2C4FF6546D19E223A6F465924A; // 0x3FC0(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1DB819984C9B7158E9179F91435D676B; // 0x3FE8(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C8BDB3AA413B86249554249FDC1FA50A; // 0x40B0(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_34716B904426B2EA7A8881A18C36884C; // 0x4128(0x00C8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_3408E05548A31616206269B78AB1B911; // 0x41F0(0x00C8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_84ED690741BC6A04F5CC7A834734EC73; // 0x42B8(0x00C8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_906FD08E4951A23996CD7A98AABE0024; // 0x4380(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2F9D05514C99E4366A09C7A4111098EC; // 0x4488(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_17A70B1A4FAC05C6BC9B4C95AB2D1B19; // 0x4590(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_0A2412484A452C4F201B0F94303E143B; // 0x4698(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_29AC230C411568C268880F9963C3F0B0; // 0x46B8(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DBA2611B44DDC26F856238A11065339A; // 0x46D8(0x0108)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3AEA610745E8A0B298389187CA1797AF; // 0x47E0(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_678AF15E49C32375CBAFC48DEB20047C; // 0x4810(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F4E2A5DF4319E0DE2C9A10933EA01AF4; // 0x4838(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2487367E4FF57304693EBB95A2A7E32C; // 0x4860(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9626BF4F40EBE94C4E1BF4A68C1DFC13; // 0x4888(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F62FDE1E440E0050895C529531DCB962; // 0x48B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37569A8D4F05BAFCF82B34BAA7F6B3FC; // 0x48D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A7BDC1344C9C59AAB88024B80E7B58E1; // 0x4900(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_65D8F1CF4F5BA02F99928F9FD4544693; // 0x4928(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B75CDC0416EBE4F615E478E9E45FF6E; // 0x4950(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88877DC546EF375C5FE5EEADCCBD4091; // 0x4978(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2025D15C498F24D80C1EE2BBA48E2284; // 0x49A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9D5545E4758FC88B058BFA5630CD024; // 0x49C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22490E114C63DC4A86EDD5AD0AE037CD; // 0x49F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DFBE26C34B3C4E025084C09A6A638396; // 0x4A18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C021D2D450E7A8F60F899A9FA56CD53; // 0x4A40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F0CA36C64896B8F7484E86B1D0EE932C; // 0x4A68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_24F83B9649A6711277CDF5BE10AA8C4C; // 0x4A90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8EE19FCD435282A6CA3584BA2D369CC3; // 0x4AB8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5E0418784015CE47DB24C0BCD98A92AF; // 0x4AE0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE333DA94A3EDE256D2ECF96B54BDA96; // 0x4B08(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5168187347003549B52DB1A3B4B1949C; // 0x4B30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A479DB9A41A09D021197DDA482D2C514; // 0x4B58(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17ADF35B4919C0CCFB7378B8B67516D3; // 0x4B80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3AB508894A48C9DD7011DBA101463985; // 0x4BA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_571FE8B947F9D2E6D09416A1F7BADED6; // 0x4BD0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2255D6DC4E709B6EAB649D9CF269BDB2; // 0x4BF8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22932B294C5DA69A04BB5998ED59C572; // 0x4C20(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_25F41D4E4CAAA632467612BD5AD11663; // 0x4C48(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_931A785A46EC2437D22AEAA57F0EA414; // 0x4C70(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E891BDBE4EB3448F739600A4B9E5EAE0; // 0x4C98(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93D0AE9D473F362F24F4E2B9FF18E175; // 0x4CC0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9B52FDB74D279F17324E0C8497D1CD75; // 0x4CE8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_609EED094413AAF3DFD9A384846A9018; // 0x4D10(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_36C62D454B1C50F5D3CB15AAE8AE1813; // 0x4D38(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7A26CB0B4D056F509CD723BB2032A7A5; // 0x4D60(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4FC866EE454ACD21F7F2E9B3673F7C02; // 0x4D88(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E3039A8C427EF7E4242382A80F2EF14E; // 0x4DB0(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EA1B6904470E3D791A591783F003B5ED; // 0x4DD8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_55C1CC044A8BC9086807379947FECFA4; // 0x4E78(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1FB7BDDA4C6AB93DAB05F68C5287F200; // 0x4F18(0x0030)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_8B0DEA704A7A5C65E7C2D082EA9BF538; // 0x4F48(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_12BBF17F46E17B099D05C9BB9A8A6EE3; // 0x4F90(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_789D76984EBBAAEC43C626B0A639B492; // 0x4FB8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6C112DC6421707430AC78090141F5F96; // 0x5030(0x0030)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_7CB6C268486D619E859BF3A9516FFD03; // 0x5060(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A9F4AA1244FCEB587733238C7E185147; // 0x50A8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0A7C6B454D38BFAAC1568983206C8E25; // 0x50D0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BA5E3CE34E1FE90753A192BFB1C935B1; // 0x5148(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4EFCFB64481A4A5DE56D2AA9AA4F400F; // 0x5178(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_41B0B1F646E764D220E3CA98B983A8CF; // 0x51A0(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_22E487904B4B770F2AD84C86E611767E; // 0x5260(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_324F9A2341E98EEF670115AE66F7DA9B; // 0x52D8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_9A3633F049AD5C7C65C71A9FEB590D63; // 0x5350(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B38455154EA6A5F17F72E48A79890663; // 0x5410(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0DC3DE194AF44E9AB53439B6AD64638A; // 0x5488(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2D971A9E4A8729C76C9156A311A13FB3; // 0x5550(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B227F15D42CF8CE8173B8A8E66E90EDC; // 0x5580(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_66E51C1446C8D57328EF718A4AA06BC5; // 0x55A8(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F3CF23B4E085A7DA6A1FBB055E290B8; // 0x5668(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E7E057342238F9E181183B0D32DAEF0; // 0x56E0(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D01E2A774934541AE873CBB7E783D650; // 0x5758(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0FD317D140EE880C281B54A4E29929EA; // 0x57D0(0x00C0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_B48D0D51421CA8849B874FB16EFE3A12; // 0x5890(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_021471964B9BCCC8417B0B9F5C263915; // 0x5958(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_25A1BAD94C553988F32244A9CA3A8DD0; // 0x5988(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_35C0C4C541A333EE13F12F883457E8BF; // 0x59B0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_43C2BDA8427644A7AF7EE2BF13A102C2; // 0x59D8(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_AE16470B478D6ABC4BECA990E6E2D054; // 0x5A50(0x00C0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_2AE5BCE840FCFDD5B8D2AFB3879B9728; // 0x5B10(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_42DDDF6F47D94392D7D6C690E58EF4F8; // 0x5BD8(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C3C768A345D8F9CDDF50FA9E61991946; // 0x5C08(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6FDA996D42F747E0C0E494AF7F2636CA; // 0x5C30(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_64663D1441073704D02716B727B5E1F0; // 0x5CF0(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A729A8924637951AF6536A8C960C2977; // 0x5D68(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4A88E2DA45C736DDCE6F4CA9D8F233FD; // 0x5DE0(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_97A980584F80E8B4A9EA0C812C16F0D0; // 0x5E58(0x00C0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3096C8E04B2AB51B8460F79C01468E71; // 0x5F18(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0F7B9A154EE2CDC362BE4189DF240EAE; // 0x5FE0(0x0030)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_08A5D7A94A09210B287A3082F5F808C4; // 0x6010(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90078BBC4A010070685586B281123102; // 0x60D0(0x0078)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5CF8206A4C114FF6B8B545AE96BC9DBD; // 0x6148(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_60243F354AF46E61E6BFD9A84AFA0502; // 0x6170(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_DA6FEB974A14A5DF994AF2BB39ED874F; // 0x61E8(0x00C0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7BB4A53A44AA6FEEE0DC65AE1AE5B81D; // 0x62A8(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AE1EFF5342D528607652048249EDED8F; // 0x6370(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3F23239D41099CE5C7461BA9BE082845; // 0x63E8(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FFDCB01C47B3E1F300460292ED67AF2C; // 0x6418(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_44345520472B8637F0ACBDA6A23CFA3C; // 0x6440(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_85BD430C43585BF2A2B04081D2BD2EC1; // 0x6500(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C11F915C42EEBE2AE48FCE84A3AC7EFD; // 0x6578(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6FFCDAA547A83968D7EF28A3CEA2054B; // 0x65F0(0x00C0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_83CFABCE407859DD2FDF16ACC4E02125; // 0x66B0(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_53A8C27641CD8BB8D9CECF9FC230A4C0; // 0x6778(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F97CE89342BC0D351C39ABB6583CF3AA; // 0x67F0(0x0030)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1EB923F84C0623097F173C82B59C0F35; // 0x6820(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F24BFB2C4F19FFA28E2185A8AF97FDEE; // 0x68E0(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_511979AF459FFB508411CDAC536C4D35; // 0x6908(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C8727687403B4EC1F0C005A403E98C5B; // 0x6930(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_03C40D8948F8BEB5A8CCED87C930C6DB; // 0x69A8(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9B286F164D20E5A21AA1DFB6D16B093E; // 0x6A70(0x0030)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_B89FF78C4B8997BB10FB9097460B9809; // 0x6AA0(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E090F002404A2D85BA6986B39D751524; // 0x6B60(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5696CC6A4F14D0FC1786E5BC6B84D742; // 0x6B88(0x0078)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7EE78E3E4D3424A14C8B86ACC58CD993; // 0x6C00(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_5179021D4A2A644071F65BAF855993EC; // 0x6C28(0x00C8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_43D3993644EC874C920FD998C627AE92; // 0x6CF0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_EE637C46453F0F52DA0A7989CDD463AE; // 0x6D20(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D0592C364E1CC2EB5BD5BE85E776D455; // 0x6DD0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_822B1FC840E566085F4341B8B1F5AD32; // 0x6E00(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC83A55341EABEF08A136AB68DDBE068; // 0x6EB0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E0B8BD6E4F9B75F45834AA8E5F74CB95; // 0x6ED8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_11E8699E4D3A167103947D93921B6BF6; // 0x6F00(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E4B162624A81432B4A8E288312487B7C; // 0x6F28(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8E09B4E3499D31908BB82999ABA9359C; // 0x6F50(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B5B324F04EF6C5664BFE69A8FCA35AD4; // 0x7018(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_61C244524FE38A227AF689A81015D348; // 0x7040(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_B45087B744721C6DA8620A9BA9FEAC47; // 0x7068(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7FAA49954ABB42A0CA568098E8A49534; // 0x7130(0x0078)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_DB84F9F141A2F2B923C229B4A9038C4C; // 0x71A8(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_205121C04CC3EC0FAB7E98967621A007; // 0x7268(0x00C0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_494765754360314F6DBBC794EAF57460; // 0x7328(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_554368B74A20C045580AF0995D42835A; // 0x7358(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2A84AC974FA49711C61D9B8766D78977;       // 0x7380(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_783DE2A3416121F01C9A2E9DB8E7A20F;       // 0x73C8(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AD878C3A43B23B22F5289B8C96ECA7A6; // 0x7410(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_84A8003D47BA3BA449BA9BB2C61280B3; // 0x7440(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_6F0EE50246333470B2D8489C8F1322EE; // 0x74F0(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EB1FE66C44E7CBF71C4D648E089732E6; // 0x75A8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DF04DF3049A6700D98A117A205081379; // 0x76B0(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B4FD723C45E71E958FD0D4B70368421B; // 0x77B8(0x0020)
	unsigned char                                      UnknownData_LF9S[0x8];                                     // 0x77D8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_72212D5A42705255BD117BAA671396E0;  // 0x77E0(0x01E0)
	struct FAnimNode_Root                              AnimGraphNode_Root_823DEEE546286C210672E9B4ACF3E2C1;       // 0x79C0(0x0030)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C30BD8D546AD60BD4F6F63AED4CD7EFF; // 0x79F0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E0E7C8674F34DD0C57005E8711769192; // 0x7A90(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A9D7E30D4C3D523B565DF68568078664; // 0x7AB8(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E1B88EA348DEE88BF63FD5BC0F885420; // 0x7AE0(0x00B8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_18F3A6544E73597990DEE1AD051865ED; // 0x7B98(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AAC854A04F6BABD9B9667DBDC090FAC3; // 0x7C38(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FDE99BA47D19119CCC0288F7014BE60; // 0x7C60(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_435B8CEC460E6ACB23E2A5B694725319; // 0x7C88(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D7F9CB6940CAD90AC03847B2152BB177; // 0x7D90(0x0108)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_0B122A3A435B3ABA5C3D3BB8AD6083CC;       // 0x7E98(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C9DFFED64178AE762F7B7688558F8943; // 0x7EE0(0x0028)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BB545AA14D3805A4BA272F9A84D8A429; // 0x7F08(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7F4401D345D76440D50D3B9713E5A11D; // 0x8010(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_9136960B4298137A487D50903A6877E6; // 0x8118(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_51AB976F4AD7397EEC0F87AE1D280D5E; // 0x8138(0x0020)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_83C2EF0D447F7B70384C149599FDA37F; // 0x8158(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_523AD75A41E768105005EF9A134015B1; // 0x81A0(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_E59FDF264014E6E7B24D5B8C4F667A72; // 0x81E8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_60CA54E846553D365DB98897B132076B; // 0x8230(0x00C0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7EE1E13941577EF9583103A088F4D453; // 0x82F0(0x00C0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_548189294624BD429F4F5780FF7092AD;  // 0x83B0(0x01E0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_85CBB2B84D0CCE80AA7E5393983CCF50;  // 0x8590(0x01E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AD4C72484841D1AA894A0F82ADB44275; // 0x8770(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_90187DF34F2814314B1C72BAA418D4AB; // 0x8798(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_02FABDE441D966E5EF3F289806DB7D45; // 0x8838(0x00A0)
	unsigned char                                      UnknownData_6NRI[0x8];                                     // 0x88D8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_0B85BFE54FD4F35855B8599F3077877C;  // 0x88E0(0x01E0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_45AA34CB452A4294CE431E9B04A9EA28;  // 0x8AC0(0x01E0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_84729C93424683833B3881AE71B423D9; // 0x8CA0(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C9A75E9F4D18D4A4583D84A00C6C31D3; // 0x8CC0(0x0020)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FB65218C4589950FCDAC01A8CE0FACF8; // 0x8CE0(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9F10564A435AC2B3F7E0748E3DBE8510; // 0x8D10(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_77FD5AEB426617045B1CBBA215D03636; // 0x8D38(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_172A9FF9453298C60368A29379DE0F28; // 0x8D68(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F52610C34B48282754DE2BBA0C977118; // 0x8E18(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_70D54CE740D850B964A41FAA49AAFEE1; // 0x8E40(0x00B8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F833684943D497728AA6B99D9B3F99C2;       // 0x8EF8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_36D98C2F409A08E3CE5182BCE76A82AD; // 0x8F40(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FCE13AA84D6E7725CBC4338339E2617E; // 0x8FE0(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9686C520440F13FD38B29E87AB985B28; // 0x90C0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_90F3CD3A44258D6B1080308AF6D6F274; // 0x91A0(0x00B8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8A1064654BB2E8AC38B472B12B0DC3EB; // 0x9258(0x00C0)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_E0B2C6B44F1D9487252DD797161CA16F; // 0x9318(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_C1AC3C17452505E1903F00A93F619B43; // 0x9430(0x0118)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0614141C4DDEAEAC218B1B81E9DA4B25; // 0x9548(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_38958AD244FA6F750EBA2AA524C641F5; // 0x9568(0x0020)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_F535D0CF47EAD82B1512089DDE8B727C; // 0x9588(0x0018)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8B33362B426D2DB6B65E1D9E7B569EAC; // 0x95A0(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E58E9413452B20DF8D528CBDFAD29580; // 0x9640(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_73E5908E4602858ABFBE5E86D73C2F23; // 0x9660(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_AA659C914AD912825A6AA5BF4AE4F7D5; // 0x9768(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C17F69AD430AE2F96EA83CA8368D035C; // 0x9788(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_BF79268643C63108E2699EB61DFA31CE; // 0x97B0(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_095B3F8C4A4AEBC96CC52B96D3CDAD03; // 0x97D0(0x00B8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_85AA7CE04FDFE844B94E9590A0719D1E; // 0x9888(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_585C40FA46C4153D8EA6328E405BC05F; // 0x98B0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F82511FC4F84B2EAD3B229B38A474C56; // 0x98D8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FF0ED6A4EDA6DDAD5C96C872325E7B2; // 0x9900(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8CD1CA37430D42A1AD8725ADD5017F06; // 0x9928(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7201AB754C7CD5D3D8C78BBDF61EBF24; // 0x9950(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE635CAE4089888D2F70128200A7A18B; // 0x9978(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FFD8C3A4E3B3DDFA954F8B53B9F2F48; // 0x99A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_493334C04000644DCFB085867A297CBD; // 0x99C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6CD58565453F6BA02BA6E089713DB57F; // 0x99F0(0x0028)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_76B018D94D581DA94F4D18B02BF56D0F; // 0x9A18(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8F5623704C8F2CE067AE9F81045D4C9C; // 0x9AB8(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AEA3DCB844BCF0530AC7EEA49F204553; // 0x9AE0(0x0030)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_12B847684296FA2C555798BB8E53A7F5; // 0x9B10(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F321846149A1548C76481BAB40189623; // 0x9B58(0x00E0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_ACBFABF14456B295DDE91182C7C5358B; // 0x9C38(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D52DC76444AD6917AC76799E784E968D; // 0x9CD8(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CD6D1B0244EB1AFCBC4508B3A4F29964; // 0x9D00(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5C48E2354C720D9F39B250BDA1ECC071; // 0x9D30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF0F21E34C742476ED759EAD9D568722; // 0x9D58(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40B00848401DDEF48A0631A789A81B82; // 0x9D80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE56D3D9476E3E605ACEF98C0CC1CC23; // 0x9DA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62DC61D84AC71FD56CF193A65A3A9BDD; // 0x9DD0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C89617C410C8CBB16A8CBBCCECB916C; // 0x9DF8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8C238C6541B52A4FEB0E948505F12384; // 0x9E20(0x0028)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_3D89497B441C28D435E45EAEF2392BF5; // 0x9E48(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7111688745453392948285B5B93A9159; // 0x9E90(0x00E0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_0B7A823846A5CAF8986BF99194EDC5BA; // 0x9F70(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7D2EE6554484061F2653B980E83755DC; // 0xA010(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4BC07DAD4CEB8342C3EB06B13CBCFDC2; // 0xA038(0x0030)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_6888379D454DE1895E4C2B9379481706; // 0xA068(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4B0AF5B44AE774AC95E2DD9C2A2F789D; // 0xA0B0(0x00E0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_1FE0EEA5402C90A149704EBDE1DEB7AF; // 0xA190(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3A4786FA46BA5A1748F3199BD74D01F4; // 0xA230(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F911061B4BEC3F55FD665C9368226609; // 0xA258(0x0030)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_C948C1254F2A40A5F94C6C9A020EEE0E; // 0xA288(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F39EAB3D41BA1EDE597ED4A71504EE9D; // 0xA2D0(0x00E0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_5804E04940704449F4C5AF90A46E03F2; // 0xA3B0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5AB20CFF4F5976A9B98F5984EE19E0F7; // 0xA450(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6D9AF90C43E7A5F7696E2D9F1AF11D95; // 0xA478(0x0030)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_58D2FF93474DDCF1CDDF6B8E4FFA9E2F; // 0xA4A8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_84C3EF7948AAB67CFB234E85E78B3F15; // 0xA4F0(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9D06815A49D1E9D3F0D3DC8966F2CE23; // 0xA5D0(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_452170B84D5D0523CB7DC094296A0E04; // 0xA5F8(0x00C8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D5DF12944510F5AC3501FBF432B2330; // 0xA6C0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE9C16C5479A45BA75A965A744E0D4F6; // 0xA6E8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9FC9AB2A49A3120BEF45029F51E5945C; // 0xA710(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C8BC94214CC08396E611B1B8BD35DE40; // 0xA738(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_72437FA24E7420FE2D432FB16EF9E00F; // 0xA760(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5B1CBAA948932C722E904D8E17B3F844; // 0xA788(0x0028)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_030E490F454E58390411AD895FE00C35; // 0xA7B0(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8DCF0BAB43297C351559E690620E0F30; // 0xA7F8(0x00C8)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_BC0D3E834DC357FF045FFCB419AD047B; // 0xA8C0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5E7AFA32409FFB4E4563A3BFCDD7830E; // 0xA960(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6C1DD5DC41C4EF465224F1ACC9822180; // 0xA9D8(0x0030)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_1C1FC5E24F098C3591ECB6816E2B7198; // 0xAA08(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_8E93960B428C9DA4B61D4F970C7B3235; // 0xAA50(0x00C8)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_1C3D4F4C47A66314A00F9A92EAEAD7C6; // 0xAB18(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FF491CE742301F349F018788F9513D2F; // 0xABB8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7D59EB2448F46458D0E874AB75B2F40D; // 0xAC30(0x0030)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_DDD3BC7A43B6A58984DE0887FD21193D; // 0xAC60(0x0048)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_3AAC08254E9527728CC01A93421D4449; // 0xACA8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6C0B22D94992AE381E585AB3C0767C23; // 0xAD48(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4503AEB0409F1458D2538AA959FF7918; // 0xAD78(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DCE68A764B9467B19A7F7CAF612E66DB; // 0xAE28(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_EC575E9E4D7CD46B3023DBA01DF1289E; // 0xAE58(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_57DC14AC4145B50DBA694D8DB6347702; // 0xAF08(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_382E66924ABF795C57D45E9C9C222867; // 0xAF38(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F63670947A52088A8546DA185BFB079; // 0xAF60(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6376C5674E7E8C2B7F6380903E56B642; // 0xAF88(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_400B8DA64A81F7A3D716DC89820E4184; // 0xAFB0(0x0028)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_97B5760A4ED168C89B3AC38D73F66309; // 0xAFD8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4F0AA6FF4A2FAA51EA0882BE3FF64320; // 0xB020(0x00E0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_CE261DF245C44A47C43880B45B51EA40; // 0xB100(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_AA9403A844B988E62B947DA5EFDD8B9F; // 0xB148(0x00C8)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_3B4E39A440E68BFAEB91D387148A8674; // 0xB210(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4D9B51F0436CD53F265F0F95B70B4EE1; // 0xB2B0(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DD03B2FB45AED3600CEED59859A83926; // 0xB2D8(0x0030)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_93B496454D5ADF4DA96CED84F8DAD629; // 0xB308(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C7D2BE9446088BC7DE7169AF100814A5; // 0xB350(0x00E0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_495EB72C447AF75E84B6F7BC771CFA34; // 0xB430(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1875217C47E3BBBE139F43B2D0FF3074; // 0xB478(0x00C8)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_3A0776D74D457D9C234032866EE14B98; // 0xB540(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_49058B034CA17742D946BF8470946F26; // 0xB5E0(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BD158FA946BD2F922CDEBC9CEA182EEE; // 0xB608(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B136909D474898521607879DF9F9FDB4; // 0xB638(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_26F883A941C4AA23C6EC1997EAF48A91; // 0xB660(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C01E84F4C40403F95870E8A3687E14A; // 0xB688(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11A4F8E14C39682238FE56953C481CEE; // 0xB6B0(0x0028)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_F28EA08A4E4ECE66BC46C4A3F4FF4E32; // 0xB6D8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_ABBFFD9648C434630C42C286A35EFE9E; // 0xB778(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E181035345EBD571DFB9A69E0A24BDEB; // 0xB7A0(0x0030)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_2C2ED2E1446C53369A28998605E42FA7; // 0xB7D0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B796F8A54F77B3D4BA2B618B7135C1A1; // 0xB818(0x00E0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_2708A877454175F8B8A3148B20E99672; // 0xB8F8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6DF3599346C0998D47710098AD57F894; // 0xB998(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AB9DF9E14A208FB6D82D7C9A258BD2F1; // 0xB9C0(0x0030)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_C23615CC4931BCFEAD016AB56B517261; // 0xB9F0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_68EBF7334262D1401EDD73A259FCCCB8; // 0xBA38(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EA3E956E4459CE20EFA4B4BC298C225A; // 0xBB18(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_CAE7BE054DC65089023A77A189722334; // 0xBB40(0x00C8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D94B0BC24910486607853FAA87435C2A; // 0xBC08(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8F6FAD9340E2D43B39129E81A3E863E7; // 0xBC30(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC5FF0AD4BA58D22425265B8FB521472; // 0xBC58(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B88DB86A4D1C146863D770823D88FD41; // 0xBC80(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0E92651D4D5437FAB1028095EEFCB2A8; // 0xBCA8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1AEB1FA347617EBC6DB4A986E53F6827; // 0xBCD0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C351BE1B4124F785EBA67ABB2187120A; // 0xBCF8(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_C5B2189B45AD77B3C688498C9F74D436; // 0xBD70(0x00C8)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F00F597B475270AC1BAFEBB9795C115D; // 0xBE38(0x0048)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_466C626146A2FA0A8F13439CFD230949; // 0xBE80(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_85CEBFA9401DFD35ECD2558E43E99E4E; // 0xBF20(0x0030)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_E980958F4A4A69128B5BC4BAB719CF69; // 0xBF50(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BD95F1FD454912088D9D6885BDDC75CE; // 0xBF98(0x00C8)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_0E94A8AF4221DDEEC5B0328D93B39D4C; // 0xC060(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19B6A2C940CFF4EF7E92F48203F06E4E; // 0xC100(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9A7526EC49C61D911D6D67BBB5F7BE81; // 0xC178(0x0030)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_7A9048DE4F70467BE1A14199D762B50E; // 0xC1A8(0x0048)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_8A1FE962406C1A69FD5F9C8E41A1439B; // 0xC1F0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C1F089104592398804496E8AE1A67EF8; // 0xC290(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9D6CE2A142E0E861F8322F8C08D1F3F8; // 0xC2C0(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9B3F90324FDE1FFFAC9385B2138090C3; // 0xC370(0x0030)
