#pragma once

// Name: Squad, Version: 13-01-2021


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct KeybindAxisStruct.KeybindAxisStruct
// 0x002C
struct FKeybindAxisStruct
{
	struct FName                                       AxisName_13_686D07634065815755D92EB24378D293;              // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FText                                       FriendlyName_17_3FEA8FEA41EF6733158DE0A3F66FB65F;          // 0x0008(0x0018) (Edit, BlueprintVisible)
	bool                                               Negative_16_5D8560A044DC9B43AF31D9855FDA7811;              // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	unsigned char                                      UnknownData_BXOU[0x3];                                     // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       Category_12_CE9B3A9A43EC454D9B3ECF89CD474765;              // 0x0024(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
