#pragma once

// Name: Squad, Version: 13-01-2021


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass mtlb_animBP.mtlb_animBP_C
// 0x20F2 (FullSize[0x2A82] - InheritedSize[0x0990])
class Umtlb_animBP_C : public USQVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0990(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_8E2F9F684D5E8D4189ECFF9FE64B5BF9;       // 0x0998(0x0030)
	struct FAnimNode_MeshSpaceRefPose                  AnimGraphNode_MeshRefPose_CE744B7C46E0170323CCFE8B71A0836F; // 0x09C8(0x0010)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_B2A0B85C4B467E705292DF92C274130C; // 0x09D8(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_7FF8046F49887E0EC0132189151845B0; // 0x0AF0(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_CA88D1274578D2A1E9814EA41C0055BB; // 0x0C08(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_DF7384204F34CBC7C4F729BDE93E624E; // 0x0D20(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_14DF6CBB4D3E6E7E3805B5B5354033D7; // 0x0E38(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_BD4E5886480D5FE73003D6969D5EAF35; // 0x0F50(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_363A81984D4E26B6ED818CB79EC93050; // 0x1068(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_B240BB4446AF2CB482C94A82283C6E87; // 0x1180(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_114506984785E52AEEA5D7B4B1547AA4; // 0x1298(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_F9C1BA5840DE8C498D8D289EB53797CF; // 0x13B0(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_41FBC97F423984263C43AD9DF6F00618; // 0x14C8(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_D17C27834B2D5FA37E1FFBB0708E86D6; // 0x15E0(0x0118)
	struct FSQAnimNode_WheelHandler                    SQAnimGraphNode_WheelHandler_1C8F9E7744F4A448CED6EB8CFA9FAB89; // 0x16F8(0x00F8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_DCA08D4C460DDB1B5F004491638C87A5; // 0x17F0(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_43FCF7F1454ADE141EF35A9D11D909FE; // 0x18A8(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_60D9AC76422F3F4093BD8EAC5453D75D; // 0x18D0(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_49F79B2E4C2BF9D65FD30BA18A623003;       // 0x18F8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_18E6426A41AE242355F7C584EEF801E7; // 0x1940(0x00C0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_74AFC21548E7F2FB591607B89106FA8D; // 0x1A00(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5E532FB544F0B2183C6F8E98826D68C9; // 0x1A78(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_1560F9324B039C7D17012D9E48C62A20; // 0x1AF0(0x00C8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_FA907B354DAFB7379781D3B1C97B750C; // 0x1BB8(0x00C8)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_7AABFE5C49E25D20FF50899793C18DB5; // 0x1C80(0x0440)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_78FD751042F54377B3390A843DC1D5B2; // 0x20C0(0x0440)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_AD811FD64E83AD40ED7888AFB84FDA60; // 0x2500(0x0440)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7175F4B54A3E37BC494155B216309D13; // 0x2940(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4F0DC7A141B87A35A6764FBA9DC68561; // 0x29F8(0x0020)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D7EC1693485ABF230EA999990E92F1F9; // 0x2A18(0x0028)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_6FD85C4840EFA6945EDE7192267C94FC; // 0x2A40(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_418783AE4F8C9F2D821699A3BF9031BB; // 0x2A60(0x0020)
	bool                                               bIsTrackLeftDestroyed;                                     // 0x2A80(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                               bIsTrackRightDestroyed;                                    // 0x2A81(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass mtlb_animBP.mtlb_animBP_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void ExecuteUbergraph_mtlb_animBP(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
