#pragma once

// Name: Squad, Version: 13-01-2021


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct S_ModeInfo.S_ModeInfo
// 0x0088
struct FS_ModeInfo
{
	struct FText                                       ModeInfo_7_2EA7F63B4CCDC8C966C006BE0C74D8A9;               // 0x0000(0x0018) (Edit, BlueprintVisible)
	class UClass*                                      Widget_11_1F431324444094E4D88F25B92424FDF2;                // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FText                                       ModeText_24_EFC4AEFA47A8DD0A2A9AF9A67640A27F;              // 0x0020(0x0018) (Edit, BlueprintVisible)
	struct FText                                       AttackText_21_A3020B964FE89E69047A16BE3CE7F3BA;            // 0x0038(0x0018) (Edit, BlueprintVisible)
	struct FText                                       DefendText_25_002E774248EF17F1493E939861D9890D;            // 0x0050(0x0018) (Edit, BlueprintVisible)
	unsigned char                                      AttackerCue_28_24323ED54A2D94370B48988505EB7A90[0x10];     // 0x0068(0x0010) UNKNOWN PROPERTY: ArrayProperty S_ModeInfo.S_ModeInfo.AttackerCue_28_24323ED54A2D94370B48988505EB7A90
	unsigned char                                      DefenderCue_29_BA14A01249E27FFC62EA4B85A7FFF4D6[0x10];     // 0x0078(0x0010) UNKNOWN PROPERTY: ArrayProperty S_ModeInfo.S_ModeInfo.DefenderCue_29_BA14A01249E27FFC62EA4B85A7FFF4D6

};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
