#pragma once

// Name: Squad, Version: 13-01-2021


#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

/*!!HELPER_DEF!!*/

/*!!DEFINE!!*/

namespace UFT
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass vehicle_technical_Skeleton_AnimBlueprint.vehicle_technical_Skeleton_AnimBlueprint_C
// 0x2258 (FullSize[0x2BE8] - InheritedSize[0x0990])
class Uvehicle_technical_Skeleton_AnimBlueprint_C : public USQVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                            // 0x0990(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_50E0E0E34BA0306B8FEDF2AE3515514D;       // 0x0998(0x0030)
	struct FAnimNode_MeshSpaceRefPose                  AnimGraphNode_MeshRefPose_D6BAA44448F7E8163ED119B9D997A1FD; // 0x09C8(0x0010)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_9A1EE47348DF5793DEB0779B58D0A396; // 0x09D8(0x0020)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_5D02AB7243132A99826171A2E09C6139; // 0x09F8(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_5C5062B84ACD46367F2233B5C9731DE5; // 0x0B10(0x0118)
	unsigned char                                      UnknownData_SOBD[0x8];                                     // 0x0C28(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_3BC792544BBBCB9CA2934BA77BE746B3;     // 0x0C30(0x01B0)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_F5A46B0C4A6ED6A14D206080260A561F;     // 0x0DE0(0x01B0)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_A4A1576B47C3BDF927D83398F3218F70;     // 0x0F90(0x01B0)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_D359EA854536A1E8E9E8EF8DB03EE359;     // 0x1140(0x01B0)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_F1E3DA0A4B3FD2FB240D4DA044A16B5A; // 0x12F0(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_49C33C424EC6A50BD247018D2B9F6EBA; // 0x1408(0x0118)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_46F7571A425C27C1934F20A142C7DE3F;     // 0x1520(0x01B0)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_FA2E479E43E87A32E7D30796CBB7351B;     // 0x16D0(0x01B0)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_7D87A0A5491FA7169D7B2F8A0E0D133F;     // 0x1880(0x01B0)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_62F518CC4305B79D7AE8B2B4A1FB96C3;     // 0x1A30(0x01B0)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_ED8B9B144710FFA0484817B416441193; // 0x1BE0(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_C8DF3A50433A9D3A7C0E5F8CFB07A9E7; // 0x1CF8(0x0118)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_A8925D9D49EAF033AA2102AC02275DC1;     // 0x1E10(0x01B0)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_BB7BBCF5409E66464695F1AC52999769; // 0x1FC0(0x0118)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_C5CE005C43B28F5DFD23A094365216AA; // 0x20D8(0x0118)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_3447F9474B87C4A56AEEB380C1670F87;     // 0x21F0(0x01B0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1388AA3C4B161C672520139E088AA942; // 0x23A0(0x0108)
	struct FAnimNode_WheelHandler                      AnimGraphNode_WheelHandler_47E3BE7243B240A7395C29B8C0ABBA28; // 0x24A8(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AB6F4B174B37258885E5D28B1A345551; // 0x2588(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2E571A4446A785F3AD00198D626238CF; // 0x2640(0x0028)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4E5D9EA94FF51447430FC5A2036ACAB5; // 0x2668(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8D434C1B4E4130752BC24DAF695B8961; // 0x2690(0x00C0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_01DBE6FE4AF31997ADE500AC0DBBE164;       // 0x2750(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E03892924E6C22FC573DA99225F41BE6; // 0x2798(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8F09D5C44846D74B57748F85BC41A4AD; // 0x28A0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6AE5A79048FC45ED201393ABFD0F74D1; // 0x29A8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B24DEA3B4B57BF4994A3B98C52DE2CC0; // 0x2AB0(0x0108)
	struct FVector                                     Wheel_L1_Scale;                                            // 0x2BB8(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Wheel_L2_Scale;                                            // 0x2BC4(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Wheel_R1_Scale;                                            // 0x2BD0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                     Wheel_R2_Scale;                                            // 0x2BDC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass vehicle_technical_Skeleton_AnimBlueprint.vehicle_technical_Skeleton_AnimBlueprint_C");
		return ptr;
	}



	void AnimGraph(struct FPoseLink* AnimGraph);
	void ExecuteUbergraph_vehicle_technical_Skeleton_AnimBlueprint(int EntryPoint);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
